[
  {
    "id": "0",
    "filterId": 2,
    "pageId": "724events",
    "title": "Site 724 Events",
    "cover": "./images/724_events.webp",
    "pictures": [
      "https://portfolio.david-devcode.fr/images/724_events_1.webp",
      "https://portfolio.david-devcode.fr/images/724_events_2.webp",
      "https://portfolio.david-devcode.fr/images/724_events_3.webp",
      "https://portfolio.david-devcode.fr/images/724_events_4.webp",
      "https://portfolio.david-devcode.fr/images/724_events_5.webp",
      "https://portfolio.david-devcode.fr/images/724_events_6.webp"
    ],
    "tags": [
      "React",
      "Débug",
      "Tests unitaires"
    ],
    "aboutText1": "Pour ce projet 724events, j'ai pris en charge le débogage et la finalisation du développement du site one-page d'une agence d'événementiel. J'ai utilisé les Chrome DevTools pour analyser le code existant et résoudre les bugs signalés, en mettant en œuvre mes compétences en JavaScript et en utilisant des outils spécifiques à React, comme React Developer Tools.",
    "aboutText2": "En plus du débogage, j'ai complété le cahier de recette détaillant les scénarios de test nécessaires pour garantir le bon fonctionnement du site, y compris des tests unitaires et fonctionnels.",
    "aboutText3": "Pour la gestion du projet, j'ai opté pour Yarn comme gestionnaire de packages et Node.js pour l'exécution du code côté serveur, facilitant ainsi la gestion des dépendances et l'exécution de tests locaux.",
    "aboutText4": "En utilisant GitHub pour la gestion de version et Visual Studio Code comme éditeur de code, la qualité du travail a été maintenue à un haut niveau. Cette approche a permis d'assurer un développement et un débogage efficaces du site, tout en mettant en valeur mes compétences en débogage, rédaction de cahiers de recette et utilisation d'outils de développement. Ces compétences sont cruciales pour garantir la qualité et la fiabilité des sites web développés.",
    "github": "https://github.com/david-backup/projet_10_724events_exercices",
    "website": ""
  },
  {
    "id": "1",
    "filterId": 2,
    "pageId": "Menu-Maker",
    "title": "Site Qwenta",
    "cover": "./images/menu_maker.webp",
    "pictures": [
      "https://portfolio.david-devcode.fr/images/menu_maker_1.webp",
      "https://portfolio.david-devcode.fr/images/menu_maker_2.webp",
      "https://portfolio.david-devcode.fr/images/menu_maker_3.webp",
      "https://portfolio.david-devcode.fr/images/menu_maker_4.webp",
      "https://portfolio.david-devcode.fr/images/menu_maker_5.webp",
      "https://portfolio.david-devcode.fr/images/menu_maker_6.webp",
      "https://portfolio.david-devcode.fr/images/menu_maker_7.webp"
    ],
    "tags": [
      "Spécifications techniques",
      "Veille technologique",
      "Solution technique",
      "Gestion de projet"
    ],
    "aboutText1": "Dans ce projet, j'ai été impliqué dans la planification du développement d'un site web pour un client. Mon rôle était de planifier le développement du site en utilisant la maquette, les spécifications fonctionnelles et les User Stories fournies. J'ai effectué une veille technologique pour rester informé des dernières tendances et technologies pertinentes, en utilisant un système de veille pour suivre les évolutions dans le domaine du développement web.",
    "aboutText2": "J'ai rédigé les spécifications techniques du projet, en identifiant les besoins fonctionnels et en décomposant les fonctionnalités en tâches spécifiques. Pour organiser le projet de manière structurée et efficace, j'ai utilisé Notion, un outil de gestion de projet pour créer un tableau Kanban, ce qui m'a permis de suivre le déroulement du projet de manière proactive.",
    "aboutText3": "Ces compétences en planification et gestion de projets sont essentielles dans le domaine du développement web, surtout dans une approche agile. La capacité à traduire les besoins fonctionnels en spécifications techniques et à organiser méthodiquement le travail est cruciale pour le succès des projets informatiques.",
    "aboutText4": "La maîtrise des outils de veille technologique et de gestion de projet, ainsi que la capacité à présenter des solutions techniques de manière claire et concise, sont indispensables pour le développement agile moderne.",
    "github": "https://github.com/david-backup/projet-7-qwenta",
    "website": ""
  },
  {
    "id": "2",
    "filterId": 2,
    "pageId": "Nina-Carducci",
    "title": "Site Nina Carducci",
    "cover": "./images/nina_cover.webp",
    "pictures": [
      "https://portfolio.david-devcode.fr/images/nina_1.webp",
      "https://portfolio.david-devcode.fr/images/nina_2.webp",
      "https://portfolio.david-devcode.fr/images/nina_3.webp",
      "https://portfolio.david-devcode.fr/images/nina_4.webp",
      "https://portfolio.david-devcode.fr/images/nina_5.webp",
      "https://portfolio.david-devcode.fr/images/nina_6.webp",
      "https://portfolio.david-devcode.fr/images/nina_7.webp",
      "https://portfolio.david-devcode.fr/images/nina_8.webp"
    ],
    "tags": [
      "SEO",
      "Performances",
      "Accessibilité"
    ],
    "aboutText1": "Dans ce projet, j'ai optimisé le référencement d'un site en améliorant sa performance et son accessibilité. Ma première tâche a été d'identifier les problèmes de chargement et de référencement, puis de proposer des recommandations pour améliorer la vitesse de chargement, la structure du code et le référencement. Pour cela, j'ai utilisé des outils spécialisés tels que Lighthouse et Wave, qui m'ont permis d'analyser et d'identifier efficacement les problèmes.",
    "aboutText2": "Ces compétences en optimisation du référencement (SEO) et en accessibilité ont été cruciales dans ce projet, car elles ont contribué à améliorer la visibilité et l'accessibilité du site, entraînant ainsi une augmentation du trafic et de la portée.",
    "aboutText3": "De plus, ma capacité à analyser et à améliorer les performances du site a eu un impact direct sur l'expérience utilisateur et la satisfaction des clients.",
    "aboutText4": "Pour mener à bien ce projet, j'ai également utilisé des méthodes spécifiques telles que l'optimisation globale du site, l'utilisation de Schema.org pour le référencement local, l'ajout de métadonnées pour les réseaux sociaux, et j'ai effectué des modifications liées à l'accessibilité du site. Enfin, j'ai produit un rapport d'optimisation détaillant toutes mes actions et leur impact sur la performance, le référencement et l'accessibilité du site.",
    "github": "https://github.com/david-backup/projet-9-nina-carducci",
    "website": "https://david-backup.github.io/projet-9-nina-carducci/"
  },
  {
    "id": "3",
    "filterId": 1,
    "pageId": "Auto-Street",
    "title": "Site Auto-Street",
    "cover": "./images/auto_street_cover.webp",
    "pictures": [
      "https://portfolio.david-devcode.fr/images/auto_street_1.webp",
      "https://portfolio.david-devcode.fr/images/auto_street_2.webp",
      "https://portfolio.david-devcode.fr/images/auto_street_3.webp",
      "https://portfolio.david-devcode.fr/images/auto_street_4.webp",
      "https://portfolio.david-devcode.fr/images/auto_street_5.webp"
    ],
    "tags": [
      "React",
      "Sass",
      "Laravel",
      "SQL"
    ],
    "aboutText1": "",
    "aboutText2": "",
    "aboutText3": "",
    "aboutText4": "",
    "github": "https://github.com/david-backup/projet_auto-street_react",
    "website": "https://auto-street.david-devcode.fr/"
  },
  {
    "id": "4",
    "filterId": 1,
    "pageId": "ArgentBank",
    "title": "Site ArgentBank",
    "cover": "./images/argentbank_cover.webp",
    "pictures": [
      "https://portfolio.david-devcode.fr/images/argent_bank_1.webp",
      "https://portfolio.david-devcode.fr/images/argent_bank_2.webp",
      "https://portfolio.david-devcode.fr/images/argent_bank_3.webp",
      "https://portfolio.david-devcode.fr/images/argent_bank_4.webp",
      "https://portfolio.david-devcode.fr/images/argent_bank_5.webp",
      "https://portfolio.david-devcode.fr/images/argent_bank_6.webp"
    ],
    "tags": [
      "React",
      "Sass",
      "Redux Toolkit",
      "Swagger"
    ],
    "aboutText1": "Dans ce projet, j'ai travaillé sur le développement front-end d'une application bancaire en utilisant React et Redux pour créer une expérience utilisateur dynamique et réactive. Ma mission principale a été d'intégrer le front-end avec le back-end via des appels API, en écrivant des appels à l'API REST pour assurer une communication fluide entre le client et le serveur.",
    "aboutText2": "J'ai utilisé React pour développer l'interface utilisateur de l'application bancaire, en me concentrant sur la création d'un tableau de bord complet et réactif pour les utilisateurs. Redux a été utilisé pour gérer les données de l'application, assurant ainsi un état global cohérent à travers l'application.",
    "aboutText3": " Pour définir les points d'accès de l'API et modéliser les interactions avec les données des transactions, j'ai utilisé Swagger, ce qui a facilité la documentation et la maintenabilité de l'interface de programmation.",
    "aboutText4": "React, Redux et Swagger sont d'excellents choix pour développer un front-end moderne, surtout pour ceux travaillant sur des applications web complexes. Ces outils permettent d'assurer la clarté et la maintenabilité de l'interface de programmation, tout en garantissant le bon fonctionnement de l'application.",
    "github": "https://github.com/david-backup/projet_11_ArgentBank",
    "website": "https://david-backup.github.io/projet_11_ArgentBank/"
  },
  {
    "id": "5",
    "filterId": 1,
    "pageId": "Portfolio",
    "title": "Mon Portfolio",
    "cover": "./images/portfolio_cover.webp",
    "pictures": [
      "https://portfolio.david-devcode.fr/images/portfolio_1.webp",
      "https://portfolio.david-devcode.fr/images/portfolio_2.webp",
      "https://portfolio.david-devcode.fr/images/portfolio_3.webp"
    ],
    "tags": [
      "React",
      "Sass"
    ],
    "aboutText1": "",
    "aboutText2": "",
    "aboutText3": "",
    "aboutText4": "",
    "github": "https://github.com/david-backup/projet_12_portfolio_version_3",
    "website": "https://portfolio.david-devcode.fr/"
  }
]